#include <iostream>
#include <tchar.h>
#include <locale>

int _tmain(int argc, _TCHAR* argv[])
{
    int n, n_orig; // цена билета в рублях
    int x = 0;  // количество жетонов по 4
    int y = 0;  // количество жетонов по 7
    int max_y; // максимальное количество жетонов по 7
    // Установка русской локали для терминала Windows 11
    system("chcp 1251 >nul");// 1-й способ. Выплнить внешнюю команду.
    // 2 - й способ. Вызов библиотечной функции.
    setlocale(LC_ALL, "russian.1251");
    // 3 - й способ. Создать переменную типа локали
    std::locale rus_locale = std::locale("russian.1251");
    // 3 - й способ. Выбор кодировки(локали) терминала
    std::cout.imbue(std::locale::global(rus_locale));
    // Ввод данных
    std::cout << "Цена билета в рублях: ";
    std::cin >> n;  // Ввод цены билета
    n_orig = n; // Запомнить введённое значение для вывода
    // Перебираем количество жетонов по 7 от максимума до 0
    max_y = n / 7;
    for (y = max_y; y >= 0; y--)
    {
        int remainder = n - 7 * y;  // Сумму разменяли на жетоны по 7
        if (remainder % 4 == 0)  // Остаток разменяли на жетоны по 4
        {
            // Если удалось разменять всю сумму, конец цикла
            x = remainder / 4;
            //  Вывод найденного решения на экран
            std::cout << "Введённую цену " << n_orig
            	      << "можно разменять на жетоны:\r\n";
            std::cout << "Количество жетонов по 4 рубля: " << x << "\r\n";
            std::cout << "Количество жетонов по 7 рублей: " << y << "\r\n";
            break;
        }
    }
    // Решений для указанной суммы нет
    if ((x <= 0) && (y <= 0))
    {
        std::cout << "Введённую цену " << n_orig
        	      << " нельзя разменять на жетоны\r\n";
    }
    // Задержка вывода на экран до нажатия клавиши "Ввод"
    std::cin.ignore();
    std::cin.get();
    return 0;

}
