#include <iostream>
#include <tchar.h>
#include <locale>

int _tmain(int argc, _TCHAR* argv[])
{
   int n;  // Цена билета в рублях
    int x = 0;  // количество жетонов по 4
    int y = 0;  // количества жетонов по 7
    bool found = false;  // флаг, нашли ли мы решение
    // Установка русской локали для терминала Windows 11
    system("chcp 1251 >nul");// 1-й способ. Выплнить внешнюю команду.
    // 2 - й способ. Вызов библиотечной функции.
    setlocale(LC_ALL, "russian.1251");
    // 3 - й способ. Создать переменную типа локали
    std::locale rus_locale = std::locale("russian.1251");
    // 3 - й способ. Выбор кодировки(локали) терминала
    std::cout.imbue(std::locale::global(rus_locale));
    // Ввод данных
    std::cout << "Цена билета в рублях: ";
    std::cin >> n;  // Ввод цены билета
    y = n / 7;  // начинаем с максимального количества жетонов по 7
    // Перебираем количество жетонов по 7 от максимума до 0 пока
    // пока не найдётся решение или не закончатся жетоны по 7
    while ((y >= 0) && (!found))
    {
        int remainder = n - 7 * y;  // Сумму разменяли на жетоны по 7
        if (remainder % 4 == 0)  // Остаток разменяли на жетоны по 4
        {
            x = remainder / 4; // Если удалось разменять всю сумму, конец цикла
            //  Вывод найденного решения на экран
            std::cout << "Введённую цену " << n
            		  << " можно разменять на жетоны:\r\n";
            std::cout << "Количество жетонов по 4 рубля: " << x << "\r\n";
            std::cout << "Количество жетонов по 7 рублей: " << y << "\r\n";
            // Флаговую переменную переменную установили в истинное значение,
            // так как нашли решение
            found = true;
        }
        y -= 1;  // уменьшаем количество жетонов по 7
    }
    // Решений для указанной суммы нет
    if (!found)
    {
        std::cout << "Введённую цену " << n
        		  << " нельзя разменять на жетоны\r\n";
    }
    // Задержка вывода на экран до нажатия клавиши "Ввод"
    std::cin.ignore();
    std::cin.get();
    return 0;
}
